# -*- coding: utf-8 -*-

import sys
import urllib.parse
import re
from lxml import etree

sys.path.append('..')
from base.spider import Spider


class Spider(Spider):
    def getName(self):
        return "禁片天堂"

    def init(self, extend):
        pass

    def homeContent(self, filter):
        cateManual = {
            "中文": "278",
            "巨乳": "15",
            "熟女": "95",
            "騎乘位": "74",
            "口交": "34",
            "癡女": "75",
            "潮吹": "32",
            "企劃片": "84",
            "美尻": "156",
            "打手槍": "98",
            "戲劇、連續劇": "58",
            "制服": "19",
            "美腿": "157",
            "舔鮑": "122",
            "美乳": "166",
            "搭訕": "12",
            "妄想族": "184",
            "第一人稱視點": "167",
            "媽媽系": "193",
            "人妻・主婦": "26",
            "多種職業": "84",
            "羞辱": "163",
            "女教師": "131",
            "淫語": "151",
            "肉感": "136",
            "愛美臀": "111",
            "背後位": "178",
            "調教": "395",
            "處男": "23",
            "護士": "283",
            "修長": "147",
            "露內褲": "169",
            "絲襪": "115",
            "愛巨乳": "200",
            "眼鏡": "290",
            "超乳": "211",
            "顏面騎乘": "263",
            "惡作劇": "145",
            "義母": "144",
            "淫亂・過激系": "63",
            "愛美腿": "11",
            "爆乳": "483",
            "女上司": "137",
            "正太": "415",
            "穿衣幹砲": "179",
            "緊身皮衣": "304",
            "學園": "421",
            "空姐": "132",
            "粉絲感謝祭": "190",
            "背面騎乗位": "646",
            "秘書": "363",
            "女主播": "106",
            "反向搭訕": "305",
            "健身教練": "233",
            "部下・同僚": "150",
            "舞蹈": "130",
